let handler = async (m, { command, text }) => m.reply(`*⎔ ⋅ ───━ •﹝👑﹞• ━─── ⋅ ⎔*
*﹝↓🪩↓تـرحـيـب↓🪩↓﹞*
*⋄━───═◞⬪👑⬪◟═───━⋄*
*〄👤┊اللـقـب⇇『』*
*〄📧┊المـنـشـن⇇『』*
*〄📽️┊مـن انـمـي⇇『』*
*〄🎎┊ بنت / ولد⇇『』*
*〄🧧┊مـن طـرف⇇『』*
*〄🎓┊الـمــسـؤول⇇『』*
*〄📊┊افـضل ثلاث انميات شاهدتها*
*🥇〘〙*
*🥈〘〙*
*🥉〘〙*
*⋄━───═◞⬪👑⬪◟═───━⋄*
*⧉🌟┋اشـرقت الانـوار بـوجـودك مـعنا و نـرحـب بك اشـد التـرحـيب لـتـسـتـمـتـع و تـقـضـي اوقـات جـمـيلة فـي نقـابـتـنـا🤍』*
*⋄━───═◞⬪👑⬪◟═───━⋄*
~*⎗ ↻┇تـــوقـيـع مـمـلكة🖋️』*~

*「👑╎𝑨𝑵𝑰𝑴𝑬╎👑」*
*⎔ ⋅ ───━ •﹝👑﹞• ━─── ⋅ ⎔*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(1)$/i

export default handler