let handler = async (m, { command, text }) => m.reply(`*⎔ ⋅ ───━ •﹝👑﹞• ━─── ⋅ ⎔*
*﹝↓📜↓إستمارة↓📜↓﹞*
*⋄━───═◞⬪👑⬪◟═───━⋄*
*〄👤┊اللـقـب⇇『』*
*〄📽️┊مـن انـمـي⇇『』*
*〄🎎┊بـنت / ولـد⇇『』*
*〄🧧┊مـن طـرف⇇『』*
*〄🏝️┊صـورة للشخصية⇇『✅』*
*〄📊┊افـضل ثلاث انميات شاهدتها*
*🥇〘〙*
*🥈〘〙*
*🥉〘〙*
*⋄━───═◞⬪👑⬪◟═───━⋄*
*⧉❕╎مـلـحـوظة』 ↶*
*⸂①┋ممنوع بنت تاخذ لقب ولد و العكس』⸃*
*⸂②┋ممنوع السبام』⸃*
*⸂③┋ممنوع الالقاب الايتشي الخ』⸃*
*⸂④┋ممنوع نشر الروابط』⸃*
*⋄━───═◞⬪👑⬪◟═───━⋄*
*❈↲ لملئ الإستمارة يرجى النسخ وملء الفراغات*
*❈↲ بعد ملئ الاستمارة منشن احد المشرفين*
*❈↲ يرجى ارفاق صورة للقب*
*⋄━───═◞⬪👑⬪◟═───━⋄*
~*⎗ ↻┇تـــوقـيـع مـمـلكة🖋️』*~

*「𝐎𝐒𝐀𝐊𝐀╎👑╎𝑨𝑵𝑰𝑴𝑬」*
*⎔ ⋅ ───━ •﹝👑﹞• ━─── ⋅ ⎔*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|الاستمارة|الإستماره|الإستمارة|0|استماره|استمارة|إستماره|إستمارة)$/i

export default handler