import { createHash } from 'crypto'
import { canLevelUp, xpRange } from '../lib/levelling.js'
import fetch from 'node-fetch'
import fs from 'fs'
const { levelling } = '../lib/levelling.js'
import moment from 'moment-timezone'
import { promises } from 'fs'
import { join } from 'path'
const time = moment.tz('Egypt').format('HH')
let wib = moment.tz('Egypt').format('HH:mm:ss')
//import db from '../lib/database.js'

let handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
    let d = new Date(new Date + 3600000)
    let locale = 'ar'
    let week = d.toLocaleDateString(locale, { weekday: 'long' })
    let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)
let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
if (!(who in global.db.data.users)) throw `✳️ لم يتم العثور على المستخدم في قاعدة البيانات الخاصة بي`
let videoUrl = 'https://telegra.ph/file/09b498c525cc7d61443c5.mp4';
  let vn = './media/menu.mp3';
  const user = global.db.data.users[m.sender];
  const {money, joincount} = global.db.data.users[m.sender];
  const {exp, limit, level, role} = 
    global.db.data.users[m.sender];
let { min, xp, max } = xpRange(user.level, global.multiplier)
let username = conn.getName(who)
let math = max - xp
let sn = createHash('md5').update(who).digest('hex')
let totalreg = Object.keys(global.db.data.users).length;
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(900) 
  const taguser = '@' +  m.sender.split('@s.whatsapp.net')[0];
let str = `〘𝐶𝛩𝑁𝐴𝑁╎👑╎𝐵𝛩𝑇〙

 *〄مرحبا يا┊⇇『${taguser}』*

*⋄━─═◞⬪إحصائياتك⬪◟═─━⋄*

*〄🔮┊مستواك⇇『${level}』*
*〄🔰┊اكسبي⇇『${xp}』*
*〄📊┊الخبرة⇇『${exp}』*
*〄💎┊الماس⇇『${limit}』*
*〄💲┊نقود⇇『${money}』*
*〄🈴┊الرموز⇇『${joincount}』*
*〄👑┊مميز⇇『${user.premiumTime > 0 ? '✅' : (isPrems ? '✅' : '❌') || ''}』*
${readMore}
          ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎

          ‎‎‎*❐═━━━═╊⊰👑⊱╉═━━━═❐* 
          *˼‏📜˹ قـسـم الـمـجـمـوعـات╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『💊↜╎دعوه』*
          *『💊↜╎منشن』*
          *『💊↜╎مخفي』*
          *『💊↜╎ترقيه』*
          *『💊↜╎اعفاء』*
          *『💊↜╎لينك』*
          *『💊↜╎جروب قفل/فتح』*
          *『💊↜╎حذف』*
          *『💊↜╎منشني』*
          *『💊↜╎توب』*
          *『💊↜╎خط』*
          *『💊↜╎زخرفه』*
          *『💊↜╎مرح』*
          *『💊↜╎الشخصيه』*
          *『💊↜╎بروفايلي』*
          *『💊↜╎شغل』*
          *『💊↜╎الترحيب』*
          *『💊↜╎المغادرة』*
          *『💊↜╎المتصدرين』*
          *『💊↜╎رستر』*
          *『💊↜╎طرد』*
          *『💊↜╎الجروبات』*
          *『💊↜╎رتبه』*
          *『💊↜╎رقم』*
          *『💊↜╎المشرفين』*
          *『💊↜╎الجروب』*
          *『💊↜╎الاشباح』*
          *『💊↜╎تكرار』*
          *『💊↜╎تحذير』*
          *『💊↜╎إزالة-تحذير』*
          *『💊↜╎مانهوا』*
          *『💊↜╎ميسي』*
          *『💊↜╎رونالدو』*
          *『💊↜╎شبهي』*
          *『💊↜╎شينشي』*
          *『💊↜╎بوت』*
          *『💊↜╎دحيح』*
          *『💊↜╎استماره』*
          *『💊↜╎جودة』*
          *『💊↜╎حبي』*
          *『💊↜╎حكمة』*
          *『💊↜╎محاكاة』*
          *『💊↜╎انمي』*
          *『💊↜╎التوقيت』*
          *『💊↜╎الخصوصيه』*
          *『💊↜╎السورس』*
          *『💊↜╎بنت』*
          *『💊↜╎بوست』*
          *『💊↜╎قص』*
          *『💊↜╎نيكو』*
          *『💊↜╎الكيوت』*
          *『💊↜╎لوغو』*
          *『💊↜╎الوداع』*
          *『💊↜╎ستوري』*
          *『💊↜╎عبارات』*
          *『💊↜╎جميل』*
          *『💊↜╎تغيير-الصوره』*
          *『💊↜╎محاكاة』*
          *『💊↜╎لمنشن』*
          *『💊↜╎الانذارات』*
          *『💊↜╎تفقد-المده』*
          *『💊↜╎حذف-المده』*
          *『💊↜╎حذف-الخلفية』*
          *『💊↜╎الكره』*
          *『💊↜╎بيحبني』*
          *『💊↜╎بيكرهني』*
          *『💊↜╎جمال』*
          *『💊↜╎شبهي』*
          *『💊↜╎مانجا』*
          *『💊↜╎تقسيم』*
          *『💊↜╎رابطي』*
          *『💊↜╎تنمر』*
          *『💊↜╎بلاك』*

          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏🕋˹ قـسـم الـديـن╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『🕌↜╎سورة』*
          *『🕌↜╎حديث』*
          *『🕌↜╎قران』*
          *『🕌↜╎الله』*
          *『🕌↜╎اذان』*
          *『🕌↜╎أذكار-المساء』*
          *『🕌↜╎أذكار-الصباح』*
          *『🕌↜╎دعاء』*

          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏🎮˹ قـسـم الـتـرفـيـه╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『🛹↜╎اكس』*
          *『🛹↜╎كت』*
          *『🛹↜╎كتت』*
          *『🛹↜╎غباء』*
          *『🛹↜╎بين』*
          *『🛹↜╎ذكاء』*
          *『🛹↜╎لو』*
          *『🛹↜╎هل』*
          *『🛹↜╎ترجم』*
          *『🛹↜╎تاج』*
          *『🛹↜╎زواج』*
          *『🛹↜╎طلاق』*
          *『🛹↜╎انطق』*
          *『🛹↜╎تاج』*
          *『🛹↜╎نصيحه』*
          *『🛹↜╎الحب』*
          *『🛹↜╎سؤال』*
          *『🛹↜╎شراء-الدجاج』*
          *『🛹↜╎رهان』*
          *『🛹↜╎لوفي』*
          *『🛹↜╎قط』*
          *『🛹↜╎رياضيات』*
          *『🛹↜╎اجابه』*
          *『🛹↜╎اديت-كار』*
          *『🛹↜╎اديت-فوت』*
          *『🛹↜╎اديت』*
          *『🛹↜╎تويت』*
          *『🛹↜╎لعبة』*
          *『🛹↜╎علم』*
          *『🛹↜╎عين』*
          *『🛹↜╎فزوره』*
          *『🛹↜╎احزر』*
          *『🛹↜╎تفجير』*
          *『🛹↜╎قلب』*
          *『🛹↜╎خروف』*
          *『🛹↜╎ورع』*
          *『🛹↜╎تهكير』*
          *『🛹↜╎هدية』*
          *『🛹↜╎تطقيم』*
          *『🛹↜╎ميمز』*
          *『🛹↜╎حروف』*
          *『🛹↜╎صراحه』*
          *『🛹↜╎شخصية』*
          *『🛹↜╎اسئلني』*
          *『🛹↜╎عمل』*
          *『🛹↜╎روليت』*


          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏🏦˹ قسم البنك╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『📮↜╎التفعيل』*
          *『📮↜╎.لفل』*
          *『📮↜╎راتب』*
          *『📮↜╎يومي』*
          *『📮↜╎هجوم』*
          *『📮↜╎الذهب』*
          *『📮↜╎البنك』*
          *『📮↜╎شراء-النقود』*
          *『📮↜╎التعدين』*
          *『📮↜╎بنك』*
          *『📮↜╎شراء-الكل』*
          *『📮↜╎تحويل』*
          *『📮↜╎تسجيل-خروج』*
          *『📮↜╎رمزي』*
          *『📮↜╎ابلاغ』*
          *『📮↜╎ذهب』*

          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏♻️˹ قـسـم الـتـحـويـل╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『♻️↜╎ملصق』*
          *『♻️↜╎ستك』*
          *『♻️↜╎ارسم』*
          *『♻️↜╎سرقة』*
          *『♻️↜╎لفيديو』*
          *『♻️↜╎لصورة』*
          *『♻️↜╎لانمي』*
          *『♻️↜╎تخيل』*
          *『♻️↜╎مكس』*
          *『♻️↜╎لجواهر』*
          *『♻️↜╎ستك』*
          *『♻️↜╎تلجراف』*
          *『♻️↜╎لكرتون』*
          *『♻️↜╎باركود』*
          *『♻️↜╎زومبي』*
          *『♻️↜╎شاذ』*
          *『♻️↜╎انطق』*
          *『♻️↜╎انطق2』*
          *『♻️↜╎تصميم』*
          *『♻️↜╎حزمه』*
          *『♻️↜╎دائري』*
          *『♻️↜╎سينا』*

          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏📱˹ قـسـم الـتـنـزيـل╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『📍↜╎انستغرام』*
          *『📍↜╎انستا』*
          *『📍↜╎شغل』*
          *『📍↜╎تيكتوك』*
          *『📍↜╎تويتر』*
          *『📍↜╎اغنية』*
          *『📍↜╎بحث』*
          *『📍↜╎فيديو』*
          *『📍↜╎تطبيق』*
          *『📍↜╎تحميل』*
          *『📍↜╎صوره』*
          *『📍↜╎ميديافاير』*

          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏🔊˹ قـسـم الـصـوت╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『🎧↜╎عميق』*
          *『🎧↜╎منفوخ』*
          *『🎧↜╎تخين』*
          *『🎧↜╎صاخب』*
          *『🎧↜╎سريع』*
          *『🎧↜╎تخينن』*
          *『🎧↜╎رفيع』*
          *『🎧↜╎روبوت』*
          *『🎧↜╎بطيء』*
          *『🎧↜╎ناعم』*
          *『🎧↜╎سنجاب』*

          *❐═━━━═╊⊰👑⊱╉═━━━═❐*
          *˼‏👥˹ قـسـم الـمـطـور╿↶*
          *⋄━───═◞⬪👑⬪◟═───━⋄*
          *『⚜️↜╎ارفعني』*
          *『⚜️↜╎ادخل』*
          *『⚜️↜╎انضم』*
          *『⚜️↜╎اخرج』*
          *『⚜️↜╎حطها-بروفايل』*
          *『⚜️↜╎بان』*
          *『⚜️↜╎فك-البان』*
          *『⚜️↜╎المبندين』*
          *『⚜️↜╎إعادة』*
          *『⚜️↜╎اعادةتشغيل』*
          *『⚜️↜╎حظر』*
          *『⚜️↜╎فك-الحظر』*
          *『⚜️↜╎ضيف-الماس』*
          *『⚜️↜╎ضيف-اكسبي』*
          *『⚜️↜╎بريم』*
          *『⚜️↜╎حذق-بريم』*
          *『⚜️↜╎المميزين』*
          *『⚜️↜╎البلوكات』*
          *『⚜️↜╎المحظورين』*
          *『⚜️↜╎نشر』*
          *『⚜️↜╎افتح/اقفل』*
          *『⚜️↜╎اعادة-التشغيل』*

          *⎔ ━─ ─ ╎⊱ ‹👑› ⊰ ╎─ ─━ ⎔*

          *ملاحظة البوت قيد التطوير و اضافة كل الاوامر*

          *⌬┇━──╌ •『👑』• ╌──━┇⌬*

`.trim();

conn.sendMessage(m.chat, {
        video: { url: videoUrl }, caption: str,
  mentions: [m.sender,global.conn.user.jid],
  gifPlayback: true,gifAttribution: 0
    }, { quoted: m });
}; 
handler.help = ['main']
handler.tags = ['group']
handler.command = ['المهام'] 

export default handler
function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}

    function ucapan() {
      const time = moment.tz('Egypt').format('HH')
      let res = "بداية يوم سعيده ☀️"
      if (time >= 4) {
        res = "صباح الخير 🌄"
      }
      if (time >= 10) {
        res = "مساء الخير ☀️"
      }
      if (time >= 15) {
        res = "مساء الخير 🌇"
      }
      if (time >= 18) {
        res = "مساء الخير 🌙"
      }
      return res
      }
