const handler = async (m, { conn, command, text }) => {
      const فععععععع = Math.floor(Math.random() * 100);
        const تسسسسسسسسسسسسسسست = فععععععع >= 50;
          const نسسسسسسسs = [
              "💝"
                ];
                  const notSoHighنسسسسسسسs = [
                      "❤️‍🔥",
                        ];
                          const تتتتتت = تسسسسسسسسسسسسسسست ? "💟" : "❤️";
                            const getRandomMessage = (messages) => messages[Math.floor(Math.random() * messages.length)];
                              const نسسسسسسس = تسسسسسسسسسسسسسسست ? getRandomMessage(نسسسسسسسs) : getRandomMessage(notSoHighنسسسسسسسs);
                                const response =`*❮ ✅ ┇ 🝳 تـم اخـتراق الضحـية بواسطه : {الهكر سينتشي} . بـدون تنـازل قم بدفع مبلغ والا سيقوم بنشر صورك ❯*`
                                  async function loading() {
                                  var مشششششش = [
                                  "⌔: جاري الاتصال بخوادم الجزار المتخصصه بالـتهكير",
                                       "```⌔: تم تحديد المستخدم لتهكيره ✅```",
                                         "```⪼ جـاري ... اختـراق الضـحيـة 0%▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                           "```⪼ جـاري ... اختـراق الضـحيـة 10%█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                             "```⪼ جـاري ... اختـراق الضـحيـة 20%██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                               "```⪼ جـاري ... اختـراق الضـحيـة 30%███▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                 "```⪼ جـاري ... اختـراق الضـحيـة 40%████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                   "```⪼ جـاري ... اختـراق الضـحيـة 50%█████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                     "```⪼ جـاري ... اختـراق الضـحيـة 60%██████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                       "```⪼ جـاري ... اختـراق الضـحيـة 80%████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                           "```⪼ جـاري ... اختـراق الضـحيـة 90%█████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                                 "```⪼ جـاري ... اختـراق الضـحيـة 100%██████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒```",
                                                                         "```يتم تحميل الاختراق.. ",
                                                                         "جاري رفع الملفات علي السيرفر...```",
                                                                                   "```تم الاتصال بجهاز الضحيه...",
                                                                                   "يتم تحميل البيانات...```",
                                                                                               "```اختراق الضحيه 100% اكتمل",
                                                                                               "```جاري جمع جميع الادله...```",
                                                                                                             "```اكتمل الاختراق```",
                                                                                                                             "``` جاري حفظ بيانات الضحيه...```",
                                                                                                                                               "``` تم حفظ بيانات الضحيه بنجاح```"
                                                                                                                                               ]
                                                                                                                                                  let { key } = await conn.sendMessage(m.chat, {text: `*❮ ⏳ ┇ جـاري تـهـكـيـر الـمـسـتـخـدم…*`, mentions: conn.parseMention(response)}, {quoted: m})
                                                                                                                                                   for (let i = 0; i < مشششششش.length; i++) {
                                                                                                                                                      await new Promise(resolve => setTimeout(resolve, 1000)); 
                                                                                                                                                         await conn.sendMessage(m.chat, {text: مشششششش[i], edit: key, mentions: conn.parseMention(response)}, {quoted: m}); 
                                                                                                                                                           }
                                                                                                                                                             await conn.sendMessage(m.chat, {text: response, edit: key, mentions: conn.parseMention(response)}, {quoted: m});         
                                                                                                                                                              }
                                                                                                                                                              loading()    
                                                                                                                                                              };
                                                                                                                                                              handler.help = ['hack'];
                                                                                                                                                              handler.tags = ['fun'];
                                                                                                                                                              handler.command = /^(تهكير|hacker)$/i;
                                                                                                                                                              export default handler;
